:PROPERTIES:
:ID:       03cc924b-b9f8-4d17-bb01-6142fa69ef72
:END:
#+TITLE: Testing a container orchestrator
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

I'm writing a CLI that manages Docker containers — think a simplified
docker-compose for a specific workflow. The integration tests need to
actually build and run Docker containers, so the test environment
itself needs a working Docker daemon inside the Dagger container.

* Getting Docker installed in the test container

  My test harness needs the =docker= CLI to verify that my
  orchestrator creates the right containers. First, let me check
  that Docker is available:

  #+NAME: dind_docker_version
  #+begin_src fixtureyaml
func: dind-container
chain:
  - with-exec: [docker, --version]
  - stdout
  #+end_src

  #+RESULTS[3595ab3467f2a1dcbacdb430fb3b489f4cb77b9f]: dind_docker_version
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call dind-container with-exec --args="docker","--version" stdout
  #+end_src

  #+RESULTS[76415b1bf2ae8d16d984b535bea5f493b16693d4]:
  : Docker version 29.3.1, build c2be9cc
  :end:

* Running the integration tests with a live Docker daemon

  Having the CLI installed isn't enough — my tests need a running
  =dockerd= to talk to. The =dind-with-docker= target starts the
  daemon with proper cgroup v2 setup and runs my command:

  #+NAME: dind_docker_info
  #+begin_src fixtureyaml
func: dind-with-docker
args:
  cmd: "docker info --format '{{.OSType}}'"
chain:
  - stdout
  #+end_src

  #+RESULTS[de157bd0460e994b6da61535e090ab514dc50b45]: dind_docker_info
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call dind-with-docker --cmd="docker info --format '{{.OSType}}'" stdout
  #+end_src

  #+RESULTS[33b96daf6164c139b2af898b2e8cf5564600e744]:
  : linux
  :end:
